#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```hcl
module.dns_mail.cloudflare_dns_record.dkim["dkim"]: Refreshing state... [id=6553784b4785438207cb4f2462096f6e]
module.dns_mail.cloudflare_dns_record.spf["spf"]: Refreshing state... [id=cf0b5da924f5af865f7449fbabcfe7f5]
module.dns_mail.cloudflare_dns_record.dmarc["dmarc"]: Refreshing state... [id=1a5c6917ff3be5cb90282c4282f07e89]
module.dns_web.cloudflare_dns_record.web["home"]: Refreshing state... [id=ef7e577ae43af8131275f2d2ed4c6c83]
module.dns_web.cloudflare_dns_record.web["auth"]: Refreshing state... [id=afb539069d3c6210fd64ac172ea17c4e]
module.dns_web.cloudflare_dns_record.web["dev"]: Refreshing state... [id=21c645c916085b58b79798ee3ba5a867]
module.dns_web.cloudflare_dns_record.web["root"]: Refreshing state... [id=d283453db7503a30f34b0e1109f9074e]
module.dns_web.cloudflare_dns_record.web["fairview"]: Refreshing state... [id=754bf6c9169f6fffe66b28fe6107c808]
module.dns_web.cloudflare_dns_record.web["admin"]: Refreshing state... [id=e3999beb8de1e600f95786095aa99d8c]
module.dns_web.cloudflare_dns_record.web["domainconnect"]: Refreshing state... [id=8c2dc3c5948ccc6e863647501ded8de1]
module.dns_web.cloudflare_dns_record.web["www"]: Refreshing state... [id=9c1cc6e7c730638371052242daa24f10]
module.dns_mail.cloudflare_dns_record.mx["3"]: Refreshing state... [id=2a838bf3ca519420d4ab5a1ab08c7c44]
module.dns_mail.cloudflare_dns_record.mx["0"]: Refreshing state... [id=ef829d65332fac7acbb900193e6bd377]
module.dns_mail.cloudflare_dns_record.mx["4"]: Refreshing state... [id=d3f54992c7ca80f30c2ce65bd432a351]
module.dns_mail.cloudflare_dns_record.mx["1"]: Refreshing state... [id=e38d60e026b6dbc6b782a2ef1105c4c4]
module.dns_mail.cloudflare_dns_record.mx["2"]: Refreshing state... [id=3fdbc5e38335d5ea438bdf8a71a0244d]
module.dns_verification.cloudflare_dns_record.verification["dmarc-cloudflare"]: Refreshing state... [id=1b8a98af0e8251f55739467b376ab89f]
module.dns_verification.cloudflare_dns_record.verification["api-acme"]: Refreshing state... [id=c01bde349d63d3f689a367796e91ad6b]
module.dns_verification.cloudflare_dns_record.verification["api-hosting"]: Refreshing state... [id=553186b6054a3d1fa3ab34a7fc47af85]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dns_mail.cloudflare_dns_record.dmarc["dmarc"] will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = "DMARC record for email policy"
      + comment_modified_on = (known after apply)
      ~ content             = ""v=DMARC1; p=none; rua=mailto:brian.anderson1222@gmail.com"" -> "v=DMARC1; p=none; rua=mailto:brian.anderson1222@gmail.com"
        id                  = "1a5c6917ff3be5cb90282c4282f07e89"
      ~ modified_on         = "2026-02-01T04:10:50Z" -> (known after apply)
        name                = "_dmarc.briananderson.xyz"
        tags                = []
      ~ ttl                 = 1 -> 3600
        # (7 unchanged attributes hidden)
    }

  # module.dns_verification.cloudflare_dns_record.verification["api-acme"] will be updated in-place
  ~ resource "cloudflare_dns_record" "verification" {
      + comment             = "ACME challenge for API SSL"
      + comment_modified_on = (known after apply)
      ~ content             = ""xd1JQooBpi8m23eTWL_yax6rWZ6MrkQ7k6HfM6P4jgk"" -> "xd1JQooBpi8m23eTWL_yax6rWZ6MrkQ7k6HfM6P4jgk"
        id                  = "c01bde349d63d3f689a367796e91ad6b"
      ~ modified_on         = "2026-02-08T07:41:17Z" -> (known after apply)
        name                = "_acme-challenge.api.briananderson.xyz"
        tags                = []
        # (8 unchanged attributes hidden)
    }

  # module.dns_verification.cloudflare_dns_record.verification["api-hosting"] will be updated in-place
  ~ resource "cloudflare_dns_record" "verification" {
      + comment             = "Firebase hosting verification for API"
      + comment_modified_on = (known after apply)
      ~ content             = ""hosting-site=briananderson-xyz-ai"" -> "hosting-site=briananderson-xyz-ai"
        id                  = "553186b6054a3d1fa3ab34a7fc47af85"
      ~ modified_on         = "2026-02-08T07:09:25Z" -> (known after apply)
        name                = "api.briananderson.xyz"
        tags                = []
        # (8 unchanged attributes hidden)
    }

  # module.dns_verification.cloudflare_dns_record.verification["dmarc-cloudflare"] will be updated in-place
  ~ resource "cloudflare_dns_record" "verification" {
      + comment             = "Cloudflare DMARC reporting"
      + comment_modified_on = (known after apply)
      ~ content             = ""v=DMARC1; p=none; rua=mailto:ce766ebb1e01429b84c6c35786232ed0@dmarc-reports.cloudflare.net"" -> "v=DMARC1; p=none; rua=mailto:ce766ebb1e01429b84c6c35786232ed0@dmarc-reports.cloudflare.net"
        id                  = "1b8a98af0e8251f55739467b376ab89f"
      ~ modified_on         = "2026-02-01T04:09:10Z" -> (known after apply)
        name                = "_dmarc.briananderson.xyz"
        tags                = []
        # (8 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["auth"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
        id          = "afb539069d3c6210fd64ac172ea17c4e"
      ~ modified_on = "2026-01-22T15:43:44Z" -> (known after apply)
        name        = "auth.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["domainconnect"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
        id          = "8c2dc3c5948ccc6e863647501ded8de1"
      ~ modified_on = "2026-01-22T15:43:42Z" -> (known after apply)
        name        = "_domainconnect.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["fairview"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
        id          = "754bf6c9169f6fffe66b28fe6107c808"
      ~ modified_on = "2026-01-22T15:43:43Z" -> (known after apply)
        name        = "fairview.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["home"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      ~ comment             = "Dynamic DNS for homelab (masked for security)" -> "Dynamic DNS for homelab"
      ~ comment_modified_on = "2026-01-22T15:43:42Z" -> (known after apply)
        id                  = "ef7e577ae43af8131275f2d2ed4c6c83"
      ~ modified_on         = "2026-01-22T15:43:42Z" -> (known after apply)
        name                = "home.briananderson.xyz"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # module.zone_settings.cloudflare_ruleset.www_redirect[0] will be created
  + resource "cloudflare_ruleset" "www_redirect" {
      + description  = "Redirect www to root domain"
      + id           = (known after apply)
      + kind         = "zone"
      + last_updated = (known after apply)
      + name         = "www-to-root-redirect"
      + phase        = "http_request_dynamic_redirect"
      + rules        = [
          + {
              + action            = "redirect"
              + action_parameters = {
                  + from_value = {
                      + preserve_query_string = true
                      + status_code           = 301
                      + target_url            = {
                          + expression = "concat("https://briananderson.xyz", http.request.uri.path)"
                        }
                    }
                }
              + description       = "301 redirect www.briananderson.xyz to briananderson.xyz"
              + enabled           = true
              + expression        = "(starts_with(http.host, "www."))"
              + id                = (known after apply)
              + logging           = (known after apply)
              + ref               = "redirect_www_to_root"
            },
        ]
      + version      = (known after apply)
      + zone_id      = "806c2f971876ec222cf0a28bca4bd9a9"
    }

  # module.zone_settings.cloudflare_zone_setting.always_use_https[0] will be created
  + resource "cloudflare_zone_setting" "always_use_https" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "always_use_https"
      + time_remaining = (known after apply)
      + value          = "on"
      + zone_id        = "806c2f971876ec222cf0a28bca4bd9a9"
    }

Plan: 2 to add, 8 to change, 0 to destroy.

Changes to Outputs:
  + homelab_records      = []

Warning: Resource Destruction Considerations

  with module.zone_settings.cloudflare_zone_setting.always_use_https[0],
  on modules/zone_settings/main.tf line 10, in resource "cloudflare_zone_setting" "always_use_https":
  10: resource "cloudflare_zone_setting" "always_use_https" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @briananderson1222, Action: `pull_request`, Workflow: `Terraform`*